## 🏗️ Infrastructure CI Report

#### 📖 Terraform Plan Summary
<details><summary>Show Plan Details</summary>

```terraform
Terraform will perform the following actions:

  # aws_cloudwatch_log_group.app_logs will be created
  + resource "aws_cloudwatch_log_group" "app_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/myapp-dev/app"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Description" = "Application logs for ECS tasks"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-app-logs"
          + "Project"     = "myapp"
        }
      + tags_all          = {
          + "Description" = "Application logs for ECS tasks"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-app-logs"
          + "Project"     = "myapp"
        }
    }

  # aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for myapp dev"
      + id                      = (known after apply)
      + name                    = "myapp-dev-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-db-subnet-group"
          + "Project"     = "myapp"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-db-subnet-group"
          + "Project"     = "myapp"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_ecr_lifecycle_policy.main will be created
  + resource "aws_ecr_lifecycle_policy" "main" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "myapp-dev-ecr-web"
    }

  # aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "myapp-dev-ecr-web"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
```

</details>


#### 💰 Infracost Estimate
```
2026-01-05T22:11:24Z INFO Autodetected 1 Terraform plan JSON file project across 1 root module
2026-01-05T22:11:24Z INFO Found Terraform plan JSON file project "tfplan.json" at directory "tfplan.json"
2026-01-05T22:11:24Z WARN 1 "aws_ecr_repository" price missing across 1 resource


Project: t-taketake/infra-spec-driven/terraform/aws/tfplan.json

 Name                                                         Monthly Qty  Unit              Monthly Cost   
                                                                                                            
 module.vpc.aws_nat_gateway.main[0]                                                                         
 ├─ NAT gateway                                                       730  hours                   $45.26   
 └─ Data processed                                         Monthly cost depends on usage: $0.062 per GB     
                                                                                                            
 module.rds.aws_db_instance.main                                                                            
 ├─ Database instance (on-demand, Single-AZ, db.t3.micro)             730  hours                   $20.44   
 ├─ Storage (general purpose SSD, gp3)                                 20  GB                       $2.76   
 └─ Additional backup storage                              Monthly cost depends on usage: $0.095 per GB     
                                                                                                            
 module.alb.aws_lb.main                                                                                     
 ├─ Application load balancer                                         730  hours                   $17.74   
 └─ Load balancer capacity units                           Monthly cost depends on usage: $5.84 per LCU     
                                                                                                            
 module.ecs.aws_ecs_service.main                                                                            
 ├─ Per GB per hour                                                   0.5  GB                       $2.02   
 └─ Per vCPU per hour                                                0.25  CPU                      $9.23   
                                                                                                            
 aws_cloudwatch_log_group.app_logs                                                                          
 ├─ Data ingested                                          Monthly cost depends on usage: $0.76 per GB      
 ├─ Archival Storage                                       Monthly cost depends on usage: $0.033 per GB     
 └─ Insights queries data scanned                          Monthly cost depends on usage: $0.0076 per GB    
                                                                                                            
 aws_ecr_repository.main                                                                                    
 └─ Storage                                                not found                                        
                                                                                                            
 module.ecs.aws_cloudwatch_log_group.ecs                                                                    
 ├─ Data ingested                                          Monthly cost depends on usage: $0.76 per GB      
 ├─ Archival Storage                                       Monthly cost depends on usage: $0.033 per GB     
 └─ Insights queries data scanned                          Monthly cost depends on usage: $0.0076 per GB    
                                                                                                            
 OVERALL TOTAL                                                                                    $97.44 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
52 cloud resources were detected:
∙ 7 were estimated
∙ 45 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                                ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ t-taketake/infra-spec-driven/terraform/aws/tfplan.json ┃           $97 ┃           - ┃        $97 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
```
